; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v7 - type_1 ?v4 - type_2)
 	      (pred_3 ?v6 - object ?v4 - type_2)
	      (pred_4 ?v7 - type_1 ?v1 - type_3)
	      (pred_2 ?v7 - type_1 ?v6 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v7 - type_1 ?v5 ?v2 - type_2)
       :precondition (and  (pred_1 ?v7 ?v5))
       :effect (and  (pred_1 ?v7 ?v2)
		     (not (pred_1 ?v7 ?v5))))

   (:action op_3
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v8) (pred_1 ?v7 ?v8) (pred_4 ?v7 ?v1))
       :effect (and (pred_2 ?v7 ?v3 ?v1)
		    (not (pred_3 ?v3 ?v8)) 
		    (not (pred_4 ?v7 ?v1))))

   (:action op_1
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v3 ?v1) (pred_1 ?v7 ?v8))
       :effect (and (pred_3 ?v3 ?v8)
		    (pred_4 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v3 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_09 obj_06 - type_3
obj_04 obj_07 obj_01 - type_2
obj_03 obj_08 obj_05 - object)
(:init
(pred_1 obj_02 obj_04)
(pred_4 obj_02 obj_09)
(pred_4 obj_02 obj_06)
(pred_3 obj_03 obj_07)
(pred_3 obj_08 obj_07)
(pred_3 obj_05 obj_01)
)
(:goal
(and
(pred_3 obj_03 obj_04)
(pred_3 obj_08 obj_07)
(pred_3 obj_05 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_02 ?b obj_06))))
)
)

; plan
1. (op_2 obj_02 obj_04 obj_07)
   deleted: (pred_1 obj_02 obj_04)
   added: (pred_1 obj_02 obj_07)
   goals met: 2 of 3
2. (op_3 obj_02 obj_03 obj_07 obj_09)
   deleted: (pred_3 obj_03 obj_07) (pred_4 obj_02 obj_09)
   added: (pred_2 obj_02 obj_03 obj_09)
   goals met: 2 of 3
3. (op_2 obj_02 obj_07 obj_04)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_04)
   goals met: 2 of 3
4. (op_1 obj_02 obj_03 obj_04 obj_09)
   deleted: (pred_2 obj_02 obj_03 obj_09)
   added: (pred_3 obj_03 obj_04) (pred_4 obj_02 obj_09)
   goals met: 3 of 3
